; domain
(define (domain disnet)
  (:requirements :typing :equality :fluents :conditional-effects)
  (:types
    primary secondary - substation)
  (:predicates
    (available ?x - substation)
    (full ?x - substation)    
    (open_line ?dirdep - substation ?dirarr - substation)
    (closed ?x - substation ?y - substation)
    (connected ?x - substation ?y - substation)
    (buildable ?x - substation ?y - substation)
    (mutable ?x - substation)
    (removed ?x - substation ?y - substation)
    (feed ?x - substation ?y - substation)
    (is-primary ?x - substation)
  ) 

   (:action change_switch_connection
    :parameters (?s1 - secondary ?s2 - substation ?s3 - substation)
    :precondition (and 
        (open_line ?s1 ?s2)
        (closed ?s1 ?s3)
        (not(feed ?s3 ?s1))
        (feed ?s1 ?s3)
        (not(= ?s1 ?s2))       
        (not(= ?s1 ?s3))
        (not(= ?s2 ?s3))       
        )
    :effect (and (not(open_line ?s1 ?s2))
        (not(open_line ?s2 ?s1))
        (not (closed ?s1 ?s3))
        (not (closed ?s3 ?s1))
        (not(feed ?s1 ?s3))
        (feed ?s1 ?s2)
        (open_line ?s1 ?s3)
        (open_line ?s3 ?s1)
        (closed ?s1 ?s2)
        (closed ?s2 ?s1)))

  (:action add_openLine
    :parameters (?s1 - substation ?s2 - substation)
    :precondition (and
        (or (available ?s1)
            (is-primary ?s1))
        (or (available ?s2)
            (is-primary ?s2))
        (buildable ?s1 ?s2)
        (mutable ?s1) 
        (mutable ?s2)
        (not(and(is-primary ?s1)
            (is-primary ?s2))
        )
        (not(= ?s1 ?s2)))
    :effect (and 
        (not(buildable ?s1 ?s2))
        (not(buildable ?s2 ?s1))
        (not(available ?s1))
        (not(available ?s2))
        (when
        ;Antecedent
        (not(is-primary ?s1))
        ;Consequence
        (and (full ?s1))
        )
        (when
        ;Antecedent
        (not(is-primary ?s2))
        ;Consequence
        (and (full ?s2))
        )
        (open_line ?s1 ?s2)
        (open_line ?s2 ?s1)
        (connected ?s1 ?s2)
        (connected ?s2 ?s1)
        ))

  (:action remove_add_openLine
    :parameters (?s1 - secondary ?s2 - secondary ?s3 - substation)
    :precondition (and 
        (open_line ?s1 ?s2)
        (full ?s1)
        (or (available ?s3)
            (is-primary ?s3))
        (mutable ?s1)
        (mutable ?s2)
        (mutable ?s3)
        (buildable ?s2 ?s3)
        (not(= ?s1 ?s2))       
        (not(= ?s1 ?s3))
        (not(= ?s2 ?s3))
        )
    :effect (and (not(open_line ?s1 ?s2))
        (not(open_line ?s2 ?s1))
        (not(connected ?s1 ?s2))
        (not(connected ?s2 ?s1))
        (not(buildable ?s2 ?s3))
        (not(buildable ?s3 ?s2))
        (not(available ?s3))
        (not(full ?s1))
        (available ?s1)
        (full ?s3)
        (open_line ?s2 ?s3)
        (open_line ?s3 ?s2)
        (connected ?s2 ?s3)
        (connected ?s3 ?s2)
        (removed ?s1 ?s2)
        (removed ?s2 ?s1)
        ))

(:action remove_openLine
    :parameters (?s1 - substation ?s2 - substation)
    :precondition (and 
        (open_line ?s1 ?s2)
        (or (full ?s1)
            (is-primary ?s1))
        (or (full ?s2)
            (is-primary ?s2))
        (mutable ?s1)
        (mutable ?s2)
        )
    :effect (and (not(open_line ?s1 ?s2))
        (not(open_line ?s2 ?s1))
        (not(connected ?s1 ?s2))
        (not(connected ?s2 ?s1))
        (not(full ?s1))
        (not(full ?s2))
        (available ?s1)
        (available ?s2)
        (removed ?s1 ?s2)
        (removed ?s2 ?s1)
        ))
 )

; problem
(define (problem disnet16n) (:domain disnet)
(:objects
	P17 P18 - Primary
	S1 S2 S3 S4 S5 S6 S7 S8 S9 S10 S11 S12 S13 S14 S15 S16 - Secondary
	)
(:init
	(is-primary P17)
	(is-primary P18)
	(connected P18 S1)(connected S1 P18)
	(feed S1 P18)
	(closed P18 S1)(closed S1 P18)
	(connected S1 S2) (connected S2 S1)
	(feed S2 S1)
	(closed S1 S2) (closed S2 S1)
	(connected S2 S3) (connected S3 S2)
	(feed S3 S2)
	(closed S2 S3) (closed S3 S2)
	(connected S3 S4) (connected S4 S3)
	(feed S4 S3)
	(closed S3 S4) (closed S4 S3)
	(connected S4 S5) (connected S5 S4)
	(feed S5 S4)
	(closed S4 S5) (closed S5 S4)
	(connected S5 S6) (connected S6 S5)
	(feed S6 S5)
	(closed S5 S6) (closed S6 S5)
	(connected P17 S7)(connected S7 P17)
	(feed S7 P17)
	(closed P17 S7)(closed S7 P17)
	(connected S7 S8) (connected S8 S7)
	(feed S8 S7)
	(closed S7 S8) (closed S8 S7)
	(connected S8 S9) (connected S9 S8)
	(feed S9 S8)
	(closed S8 S9) (closed S9 S8)
	(connected S9 S10) (connected S10 S9)
	(feed S10 S9)
	(closed S9 S10) (closed S10 S9)
	(connected S10 S11) (connected S11 S10)
	(feed S11 S10)
	(closed S10 S11) (closed S11 S10)
	(connected S11 S12) (connected S12 S11)
	(feed S12 S11)
	(closed S11 S12) (closed S12 S11)
	(connected S10 S13) (connected S13 S10)
	(feed S13 S10)
	(closed S10 S13) (closed S13 S10)
	(connected P18 S14)(connected S14 P18)
	(feed S14 P18)
	(closed P18 S14)(closed S14 P18)
	(connected S14 S15) (connected S15 S14)
	(feed S15 S14)
	(closed S14 S15) (closed S15 S14)
	(connected S15 S16) (connected S16 S15)
	(feed S16 S15)
	(closed S15 S16) (closed S16 S15)
	(connected S12 S6) (connected S6 S12)
	(feed S6 S12)
	(open_line S12 S6) (open_line S6 S12)
	(connected S16 S13) (connected S13 S16)
	(feed S13 S16)
	(open_line S16 S13) (open_line S13 S16)
	(feed P17 P17)
	(feed P18 P18)
	(available P17)
	(available P18)
	(available S1)
	(available S2)
	(available S3)
	(available S4)
	(available S5)
	(available S6)
	(available S7)
	(available S8)
	(available S9)
	(full S10)
	(available S11)
	(available S12)
	(available S13)
	(available S14)
	(available S15)
	(available S16)
	(buildable S1 S7)
	(buildable S7 S1)
	(buildable S9 S4)
	(buildable S4 S9)
	(buildable S8 S10)
	(buildable S10 S8)
	(buildable P18 S8)
	(buildable S8 P18)
	(buildable S5 P17)
	(buildable P17 S5)
	(buildable S13 S11)
	(buildable S11 S13)
	(mutable S1)
	(mutable S7)
	(mutable S9)
	(mutable S4)
	(mutable S8)
	(mutable S10)
	(mutable P18)
	(mutable S5)
	(mutable P17)
	(mutable S12)
	(mutable S6)
	(mutable S13)
	(mutable S11)
	(mutable S16)
	(mutable S15)
	)
(:goal (and
	(connected P17 S7)(connected S7 P17)
	(closed P17 S7)(closed S7 P17)
	(connected S7 S1) (connected S1 S7)
	(closed S7 S1) (closed S1 S7)
	(connected S1 S2) (connected S2 S1)
	(closed S1 S2) (closed S2 S1)
	(connected S2 S3) (connected S3 S2)
	(closed S2 S3) (closed S3 S2)
	(connected S3 S4) (connected S4 S3)
	(closed S3 S4) (closed S4 S3)
	(connected S4 S9) (connected S9 S4)
	(open_line S4 S9) (open_line S9 S4)
	(connected S9 S10) (connected S10 S9)
	(closed S9 S10) (closed S10 S9)
	(connected S10 S8) (connected S8 S10)
	(closed S10 S8) (closed S8 S10)
	(connected S8 P18)(connected P18 S8)
	(closed S8 P18)(closed P18 S8)
	(connected P17 S5)(connected S5 P17)
	(closed P17 S5)(closed S5 P17)
	(connected S5 S6) (connected S6 S5)
	(closed S5 S6) (closed S6 S5)
	(connected S6 S12) (connected S12 S6)
	(closed S6 S12) (closed S12 S6)
	(connected S12 S11) (connected S11 S12)
	(closed S12 S11) (closed S11 S12)
	(connected S11 S13) (connected S13 S11)
	(closed S11 S13) (closed S13 S11)
	(connected S13 S16) (connected S16 S13)
	(closed S13 S16) (closed S16 S13)
	(connected S16 S15) (connected S15 S16)
	(open_line S16 S15) (open_line S15 S16)
	(connected S15 S14) (connected S14 S15)
	(closed S15 S14) (closed S14 S15)
	(connected S14 P18)(connected P18 S14)
	(closed S14 P18)(closed P18 S14)
	(removed S1 P18)
	(removed P18 S1)
	(removed S5 S4)
	(removed S4 S5)
	(removed S8 S7)
	(removed S7 S8)
	(removed S9 S8)
	(removed S8 S9)
	(removed S11 S10)
	(removed S10 S11)
	(removed S13 S10)
	(removed S10 S13)
	)
)
)

; plan
1. (add_openline p18 s8)
   deleted: (buildable p18 s8) (buildable s8 p18) (available p18) (available s8)
   added: (full s8) (open_line p18 s8) (open_line s8 p18) (connected p18 s8) (connected s8 p18)
   goals met: 44 of 84
2. (add_openline s5 p17)
   deleted: (buildable s5 p17) (buildable p17 s5) (available s5) (available p17)
   added: (full s5) (open_line s5 p17) (open_line p17 s5) (connected s5 p17) (connected p17 s5)
   goals met: 46 of 84
3. (add_openline s1 s7)
   deleted: (buildable s1 s7) (buildable s7 s1) (available s1) (available s7)
   added: (full s1) (full s7) (open_line s1 s7) (open_line s7 s1) (connected s1 s7) (connected s7 s1)
   goals met: 48 of 84
4. (add_openline s13 s11)
   deleted: (buildable s13 s11) (buildable s11 s13) (available s13) (available s11)
   added: (full s13) (full s11) (open_line s13 s11) (open_line s11 s13) (connected s13 s11) (connected s11 s13)
   goals met: 50 of 84
5. (change_switch_connection s11 s13 s10)
   deleted: (open_line s11 s13) (open_line s13 s11) (closed s11 s10) (closed s10 s11) (feed s11 s10)
   added: (feed s11 s13) (open_line s11 s10) (open_line s10 s11) (closed s11 s13) (closed s13 s11)
   goals met: 52 of 84
6. (remove_openline s10 s11)
   deleted: (open_line s10 s11) (open_line s11 s10) (connected s10 s11) (connected s11 s10) (full s10) (full s11)
   added: (available s10) (available s11) (removed s10 s11) (removed s11 s10)
   goals met: 54 of 84
7. (change_switch_connection s5 p17 s4)
   deleted: (open_line s5 p17) (open_line p17 s5) (closed s5 s4) (closed s4 s5) (feed s5 s4)
   added: (feed s5 p17) (open_line s5 s4) (open_line s4 s5) (closed s5 p17) (closed p17 s5)
   goals met: 56 of 84
8. (remove_add_openline s5 s4 s9)
   deleted: (open_line s5 s4) (open_line s4 s5) (connected s5 s4) (connected s4 s5) (buildable s4 s9) (buildable s9 s4) (available s9) (full s5)
   added: (available s5) (full s9) (open_line s4 s9) (open_line s9 s4) (connected s4 s9) (connected s9 s4) (removed s5 s4) (removed s4 s5)
   goals met: 62 of 84
9. (change_switch_connection s1 s7 p18)
   deleted: (open_line s1 s7) (open_line s7 s1) (closed s1 p18) (closed p18 s1) (feed s1 p18)
   added: (feed s1 s7) (open_line s1 p18) (open_line p18 s1) (closed s1 s7) (closed s7 s1)
   goals met: 64 of 84
10. (remove_openline s1 p18)
   deleted: (open_line s1 p18) (open_line p18 s1) (connected s1 p18) (connected p18 s1) (full s1)
   added: (available s1) (available p18) (removed s1 p18) (removed p18 s1)
   goals met: 66 of 84
11. (change_switch_connection s8 p18 s7)
   deleted: (open_line s8 p18) (open_line p18 s8) (closed s8 s7) (closed s7 s8) (feed s8 s7)
   added: (feed s8 p18) (open_line s8 s7) (open_line s7 s8) (closed s8 p18) (closed p18 s8)
   goals met: 68 of 84
12. (remove_add_openline s7 s8 s10)
   deleted: (open_line s7 s8) (open_line s8 s7) (connected s7 s8) (connected s8 s7) (buildable s8 s10) (buildable s10 s8) (available s10) (full s7)
   added: (available s7) (full s10) (open_line s8 s10) (open_line s10 s8) (connected s8 s10) (connected s10 s8) (removed s7 s8) (removed s8 s7)
   goals met: 72 of 84
13. (change_switch_connection s10 s8 s9)
   deleted: (open_line s10 s8) (open_line s8 s10) (closed s10 s9) (closed s9 s10) (feed s10 s9)
   added: (feed s10 s8) (open_line s10 s9) (open_line s9 s10) (closed s10 s8) (closed s8 s10)
   goals met: 72 of 84
14. (change_switch_connection s9 s10 s8)
   deleted: (open_line s9 s10) (open_line s10 s9) (closed s9 s8) (closed s8 s9) (feed s9 s8)
   added: (feed s9 s10) (open_line s9 s8) (open_line s8 s9) (closed s9 s10) (closed s10 s9)
   goals met: 74 of 84
15. (remove_openline s9 s8)
   deleted: (open_line s9 s8) (open_line s8 s9) (connected s9 s8) (connected s8 s9) (full s9) (full s8)
   added: (available s9) (available s8) (removed s9 s8) (removed s8 s9)
   goals met: 76 of 84
16. (change_switch_connection s12 s6 s11)
   deleted: (open_line s12 s6) (open_line s6 s12) (closed s12 s11) (closed s11 s12) (feed s12 s11)
   added: (feed s12 s6) (open_line s12 s11) (open_line s11 s12) (closed s12 s6) (closed s6 s12)
   goals met: 76 of 84
17. (change_switch_connection s11 s12 s13)
   deleted: (open_line s11 s12) (open_line s12 s11) (closed s11 s13) (closed s13 s11) (feed s11 s13)
   added: (feed s11 s12) (open_line s11 s13) (open_line s13 s11) (closed s11 s12) (closed s12 s11)
   goals met: 76 of 84
18. (change_switch_connection s13 s11 s10)
   deleted: (open_line s13 s11) (open_line s11 s13) (closed s13 s10) (closed s10 s13) (feed s13 s10)
   added: (feed s13 s11) (open_line s13 s10) (open_line s10 s13) (closed s13 s11) (closed s11 s13)
   goals met: 78 of 84
19. (remove_openline s10 s13)
   deleted: (open_line s10 s13) (open_line s13 s10) (connected s10 s13) (connected s13 s10) (full s10) (full s13)
   added: (available s10) (available s13) (removed s10 s13) (removed s13 s10)
   goals met: 80 of 84
20. (change_switch_connection s16 s13 s15)
   deleted: (open_line s16 s13) (open_line s13 s16) (closed s16 s15) (closed s15 s16) (feed s16 s15)
   added: (feed s16 s13) (open_line s16 s15) (open_line s15 s16) (closed s16 s13) (closed s13 s16)
   goals met: 84 of 84
